constant/filmRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/filmRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       760;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       780;
    }
    coupledWall_top
    {
        type            patch;
        nFaces          400;
        startFace       800;
    }
    region0_to_filmRegion_coupledWall
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mappedPatch
)
;
        nFaces          400;
        startFace       1200;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
400
(
(0 0 1.38778e-17)
(0 1.38778e-17 1.38778e-17)
(0 -1.38778e-17 0)
(0 0 1.38778e-17)
(0 0 0)
(0 0 0)
(0 -5.55112e-17 0)
(0 5.55112e-17 0)
...
)
;
    }
    side1
    {
        type            patch;
        nFaces          20;
        startFace       1600;
    }
    side2
    {
        type            patch;
        nFaces          20;
        startFace       1620;
    }
)

// ************************************************************************* //
