constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    side
    {
        type            patch;
        nFaces          800;
        startFace       11200;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       12000;
    }
    ground
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       12200;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       12360;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       12400;
        sampleMode      nearestPatchFace;
        sampleRegion    pyrolysisRegion;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
400
(
(-0 -0 -1.38778e-17)
(-0 -1.38778e-17 -1.38778e-17)
(-0 1.38778e-17 -0)
(-0 -0 -1.38778e-17)
(-0 -0 -0)
(-0 -0 -0)
(-0 5.55112e-17 -0)
(-0 -5.55112e-17 -0)
...
)
;
    }
)

// ************************************************************************* //
