constant/pyrolysisRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/pyrolysisRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    coupledWall_top
    {
        type            patch;
        nFaces          400;
        startFace       2800;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       3200;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
400
(
(0 0 1.38778e-17)
(0 1.38778e-17 1.38778e-17)
(0 -1.38778e-17 0)
(0 0 1.38778e-17)
(0 0 0)
(0 0 0)
(0 -5.55112e-17 0)
(0 5.55112e-17 0)
...
)
;
    }
    oneDEmptyPatch
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12800;
        startFace       3600;
    }
)

// ************************************************************************* //
